---
kind: other
id: Methods.T:Autodesk.Revit.DB.BasicFileInfo
source: html/4ac8e82b-46bc-76e9-56a9-deadc5762d7f.htm
---
# BasicFileInfo Methods

Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path